Tekla Open API Reference for Tekla Structures 2025
PolyLine.Equality Operator
 Checks the equality of two polylines.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator ==(
	PolyLine PolyLine1,
	PolyLine PolyLine2
)
Public Shared Operator = (
	PolyLine1 As PolyLine,
	PolyLine2 As PolyLine
) As Boolean
Parameters
PolyLine1
Type: Tekla.Structures.Geometry3d.PolyLine
The first polyline to be used.
PolyLine2
Type: Tekla.Structures.Geometry3d.PolyLine
The second polyline to be used.
Return Value
Type: Boolean
True if the two polylines are equal. False otherwise.
See Also
Reference
PolyLine Class
Tekla.Structures.Geometry3d Namespace